// 有一个最多只能装10斤的背包。现有"茄子4斤","白菜2斤","西红柿3斤","青椒1.6斤","黄瓜1.1斤","土豆5.2斤"。设计一个程序使背包里装的物品总重量最大（每件物品要么装进袋子，要么不装)。
#include"stdio.h"
void main()
{
	int a,b,c,d,e,f;
	float max=0.0,x;
	int s[6];
	char *str[6]={"茄子4斤","白菜2斤","西红柿3斤","青椒1.6斤","黄瓜1.1斤","土豆5.2斤"};
	for(a=0;a<=1;a++)
		for(b=0;b<=1;b++)
			for(c=0;c<=1;c++)
				for(d=0;d<=1;d++)
					for(e=0;e<=1;e++)
						for(f=0;f<=1;f++)
						{
							x=a*4+b*2+c*3+d*1.6+e*1.1+f*5.2;
							if(x<=10&&x>max)
							{
								max=x;
								s[0]=a;s[1]=b;s[2]=c;s[3]=d;s[4]=e;s[5]=f;
							}
						}
	printf("背包的总重为:%f\n",max);
	int i;
	for(i=0;i<6;i++)
	{
		if(s[i]!=0)
			puts(str[i]);
	}
}